_Rarzrabotki/Rarus/USO2/Reports/СМ_ЖурналУчетаВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СМ_ЖурналУчетаВыполненныхРабот</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТрудозатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьМашины</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ОбъектыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ОбъектыСтроительства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъектаСтроительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГенподрядчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМесячныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНедельноСуточныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураРаботЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиЗаполнятьПлановыйРасходМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьФактРаботыВодителейТехникиПутевымиЛистами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМатериалы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовИсполнители</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМеханизмы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроектMSP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторОбъектныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_214ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВестиРаспределениеМатериаловПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСводныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_НоменклатураДляЗаказаПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ОбъектСтроительстваERP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ИндекснаяСтраницаWebKit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_РолиУчастниковСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/СМ_ЖурналУчетаВыполненныхРабот/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ГлобальнаяСтрокаДереваСмет = Неопределено И Не ГлобальнаяСтрокаДереваСмет.ПометкаУдаления Тогда
		Смета = ГлобальнаяСтрокаДереваСмет.Ссылка;
	КонецЕсли;

	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	ВключатьВОтчет = 1;
	
	Если Не ЗначениеЗаполнено(КлючОбъектСмета) Тогда
		КлючОбъектСмета = "ПоСметам";
		Если Не ГлобальнаяСтрокаДереваСмет = Неопределено И Не ГлобальнаяСтрокаДереваСмет.ПометкаУдаления Тогда
			Смета 				= ГлобальнаяСтрокаДереваСмет.Ссылка;
			ОбъектСтроительства = ГлобальнаяСтрокаДереваСмет.Стройка;
		КонецЕсли;
	КонецЕсли;
	ВидимостьЭлементов();
	Элементы.ПолеВидаСравнения.СписокВыбора.Добавить(ВидСравнения.Равно);
	Элементы.ПолеВидаСравнения.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	ПолеВидаСравнения = ВидСравнения.Равно;

	ВключатьВОтчетПриИзменении();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СметаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС 	= Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВключатьОС",Истина);
	СтруктураПараметров.Вставить("ВключатьСС",Истина);
	СтруктураПараметров.Вставить("БезПомеченных",Истина);
	СтруктураПараметров.Вставить("ОтборСтройка",Истина);

	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьВОтчетПриИзменении()
	
	Если ВключатьВОтчет = 4 Тогда
		Элементы.Период.Видимость = Истина;	
	Иначе
		Элементы.Период.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючОбъектСметаПриИзменении(Элемент)
	
	ВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВидаСравненияПриИзменении(Элемент)
	
	Если ПолеВидаСравнения = ВидСравнения.ВСписке Тогда
		Стройка 			= ОбъектСтроительства;
		ОбъектСтроительства = Новый СписокЗначений;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.СМ_ОбъектыСтроительства"));
		
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);

		ОбъектСтроительства.ТипЗначения = ДопустимыеТипы;
		ОбъектСтроительства.Добавить(Стройка);
	Иначе
		СписокСтроек = ОбъектСтроительства;
		ОбъектСтроительства = ?(СписокСтроек.Количество()=0,ПредопределенноеЗначение("Справочник.СМ_ОбъектыСтроительства.ПустаяСсылка"),СписокСтроек[0].Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Период) И ВключатьВОтчет = 4 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен период отчета!'"));
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Элементы.ОбъектСтроительства.Видимость	= КлючОбъектСмета = "ПоОбъектам";
	Элементы.ПолеВидаСравнения.Видимость	= КлючОбъектСмета = "ПоОбъектам";
	Элементы.Смета.Видимость				= КлючОбъектСмета <> "ПоОбъектам";
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Если КлючОбъектСмета = "ПоОбъектам" Тогда
		ОтчетОбъект.ПолучитьЗаполненныйОтчет(ЭтаФорма.ОбъектСтроительства,Результат,Период.ДатаНачала,НачалоМесяца(Период.ДатаОкончания),ВключатьВОтчет,ВыводитьТитульныйЛист,ВыводитьОстатки,ВыводитьИтоги,УчитыватьКорректировки);
	ИначеЕсли КлючОбъектСмета = "ПоСметам" Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.Смета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнена смета!'"));
			Возврат;
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Смета.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Смета не проведена!'"));
			Возврат;
		КонецЕсли;
	
		Если ЭтаФорма.Смета.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Смета помечена на удаление!'"));
			Возврат;
		КонецЕсли;
		
		ОтчетОбъект.ПолучитьЗаполненныйОтчет(Смета,Результат,Период.ДатаНачала,НачалоМесяца(Период.ДатаОкончания),ВключатьВОтчет,ВыводитьТитульныйЛист,ВыводитьОстатки,ВыводитьИтоги,УчитыватьКорректировки);		
		
	КонецЕсли;
	
	Результат.АвтоМасштаб 			= Истина;
	Результат.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	Результат.ОтображатьСетку 		= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Смета = ТекЛС;
	
	Если ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") ИЛИ
		 ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		 Элементы.УчитыватьКорректировки.Доступность = Ложь;
		 ЭтаФорма.УчитыватьКорректировки = Ложь;
	Иначе	 
		 Элементы.УчитыватьКорректировки.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ВыводитьМашины 		= Истина;
	Отчет.ВыводитьМатериалы    	= Истина;
	Отчет.ВыводитьТрудозатраты 	= Истина;
КонецПроцедуры

#КонецОбласти
